Revit 2024 API
AssetPropertyString.Value Property
 value of the property
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Value { get; set; }
Visual Basic
Public Property Value As String
	Get
	Set
Visual C++
public:
property String^ Value {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The input value is invalid for this AssetPropertyString property.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The asset property is not editable.
See Also
AssetPropertyString Class
Autodesk.Revit.DB.Visual Namespace